{
    "name": "flynn.story",
    "quests": [
        {
            "name": "A Sheep in Wolf's Clothing",
            "id": "flynn.story.1",
            "objectives": [
                "Step through the gateway in the Wild Woods to enter the first Fairy Tale Trial.",
                "Explore the Fairy Tale Trial.",
                "Investigate the mysterious, growling doorway...",
                "Prove the Wolf of the Wilds isn't really a wolf by searching the Trial for evidence to disprove:\r\n  ‧ What big feet he has.\r\n  ‧ What a wolfish smell he has.\r\n  ‧ What a fierce howl he has.",
                "Bring the evidence to the door.",
                "Talk to Flynn.",
                "Interact with the source of the corruption inside the Fairy Tale Trial.",
                "Return to the Storybook Vale.",
                "Talk to Flynn.",
                "Place the foundations for Flynn Rider's House anywhere in the Storybook Vale.",
                "Unlock Flynn Rider's House by interactiong with the Scrooge McDuck Sign beside it.",
                "Welcome Flynn Rider to the Vale!",
                "Return to Flynn."
            ],
            "rewards": [
                "Unlock Flynn"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "Curiouser and Curiouser...",
            "id": "flynn.story.2",
            "objectives": [
                "You've cleared away the ink blocking the way, and discovered a new part of Everafter.\r\n  ‧ Explore the Teapot Falls.",
                "The way forward is blocked by those curious giant teacups.\r\n  ‧ Take a picture of them.",
                "The way is blocked, and there are no clues about how to proceed...\r\n  ‧ Explore the Wild Woods to find a Villager who might be able to help you. (Note: Until certain quest progress has been made, this step is not able to be completed.)",
                "Maybe a Villager who's spent more time in Everafter knows what these are...\r\n  ‧ Show Flynn the pictures.",
                "To clear the way to the Teapot Falls, you'll need some help from someone knowledgeable...\r\n  ‧ Talk to the Lorekeeper.",
                "Catch Snippets to restore the story of Aurora to the Lorekeeper's pages.\r\n  ‧ 10 Green Frog Snippet.\r\n  ‧ 5 Pink Frog Snippet.\r\n  ‧ 3 Blue Bird Snippet.",
                "Restore the Aurora and the Teapot Falls tale to the Lorekeeper's pages.",
                "Find the bookshelf shown in Aurora's story in the Bind and search if for Aurora's Notes.",
                "Gather the Ingredients from Aurora's notes:\r\n  ‧ 5 Sour Berries.\r\n  ‧ 5 Yellow Tale Cone Flowers.\r\n  ‧ 4 Volcanic Rock.\r\n  ‧ 3 Slate Gray Rose.",
                "Craft the Teacup Shovel Potion.",
                "Use the Teacup Shovel Potion in your Inventory.",
                "Return to the Teapot Falls and remove the debris blocking the way.\r\n  ‧ Activate the Fairy Tale Trial using your Royal Net."
            ],
            "rewards": [
                "500 Friendship"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "The Fallen Fortress",
            "id": "flynn.story.3",
            "objectives": [
                "Explore the area around the Fallen Fortress.",
                "There seems to be something important on the other side of those crumbling castle walls...\r\n  ‧ Look for a way to lower the castle's drawbridge.",
                "The drawbridge won't budge. You might need help on this one...\r\n  ‧ Explore the Wild Woods to find a Villager who might be able to help you.",
                "The drawbridge won't budge. You might need help on this one...\r\n  ‧ Talk to Flynn about the mysterious Fortress and its drawbridge.",
                "Examine Flynn's Drawing of Armor in your Inventory.",
                "Gather the materials required to craft the Fairy Tale Armor:\r\n  ‧ 5 Iron Ingot.\r\n  ‧ 3 White Rose.\r\n  ‧ 2 Opal.\r\n  ‧ 2 Star Sapphire.",
                "Craft the Fairytale Armor.",
                "Return to Flynn.",
                "You are making good progress on your way to becoming a knight! Complete the journey by:\r\n  ‧ Wearing Fairytale Armor.\r\n  ‧ Hanging out with your squire (Flynn!).\r\n  ‧ (Optional) Tame any Baby Dragon in Everafter.",
                "You are officially a knight! Congratulations, the Brave.\r\n  ‧ Lower the drawbridge to the Fallen Fortress.",
                "The drawbridge is lowered!\r\n  ‧ Enter the Fortress grounds and activate the Fairy Tale Trial with your Royal Net."
            ],
            "rewards": [
                "500 Friendship",
                "Fairytale Armor"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "Teapot Falls",
            "id": "flynn.story.4",
            "objectives": [
                "Enter the Fairy Tale Trial at the Teapot Falls.",
                "Explore the Fairy Tale Trial with Flynn.",
                "Set the table for tea time.\r\n  ‧ The Ornate Pink Chair.\r\n  ‧ The Sturdy Wooden Chair.\r\n  ‧ The Elegant Blue Chair.",
                "(Optional) Check in with Flynn.",
                "Find the Stout Tea Pot and Tall Tea Pot and put them both on the tray at the end of the table.",
                "Figure out what to do with the clock on the wall.",
                "Interact with the source of the corruption inside the Fairy Tale Trial."
            ],
            "rewards": [
                "500 Friendship"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "The Knights of the Round Table",
            "id": "flynn.story.5",
            "objectives": [
                "nter the Fairy Tale Trial near the Fallen Fortress",
                "Explore the Fairy Tale Trial.",
                "These knight statues seem to be missing something...",
                "Search for and return the missing piece to each knight. (3 pieces)",
                "Position each knight to face its foe.",
                "Interact with the source of the corruption inside the Fairy Tale Trial."
            ],
            "rewards": [
                "500 Friendship"
            ],
            "dlc": false,
            "friendship": 0
        }
    ]
}