{
    "icon": "star",
    "name": "hades.friendship",
    "quests": [
        {
            "name": "Mythic Restoration",
            "id": "hades.friendship.1",
            "objectives": [
                "Gather magical resources for Hades:\r\n  ‧ 3 Crimson Eternal Poppies.\r\n  ‧ 5 Posidonia plants from waters outside of ripples in Mythopia.\r\n  ‧ 10 Gravel from Mythopia's ground.",
                "Return to Hades with the magical resources so he can upgrade your Royal Pickaxe.",
                "Clean up Hades' domain.\r\n  ‧ Remove 10 fallen hunks of Marble in Mythopia.\r\n  ‧ Catch 5 Demon Snippets in Mythopia.",
                "Talk to Hades.",
                "Gather resources to build statues of Hades.\r\n  ‧ 4 Marble.\r\n  ‧ 4 Magma.\r\n  ‧ 4 Gold Nuggets.",
                "Craft 4 statues of Hades.",
                "Decorate Mythopia with Hades' statues to increase his popularity.",
                "Talk to Hades about his new statues.",
                "Dress up in a camouflaged outfit.\r\n  ‧ Rustic Clothing.\r\n  ‧ Green Clothing.\r\n  ‧ Brown Clothing.",
                "Go undercover to be a spy for Hades.\r\n  ‧ Spy on (2) various Villagers around the Library of Lore as they meet to discuss Hades and his statues.",
                "Talk to The Lorekeeper.",
                "Gather resources to fuel the Lightning Generator.\r\n  ‧ 3 Lightning Spice.",
                "Fuel the Lightning Generator in the East Wing of the Library of Lore, using the Lightning Spice.",
                "Talk to Hades in the East Wing of the Library of Lore about the Lightning Generator.\r\n  ‧ Talk to Hades about the Lightning Generator."
            ],
            "rewards": [
                "600 Friendship",
                "4 Marble Hades Statue"
            ],
            "dlc": false,
            "friendship": 2
        },
        {
            "name": "Yes, Your Lugubriousness",
            "id": "hades.friendship.2",
            "objectives": [
                "Talk to Remy about Hades taking over Chez Remy for a day.",
                "Make sure you have the Ingredients for the Grecian Baked Fish in your Inventory.\r\n  ‧ 2 Salt from Everafter's waters.\r\n  ‧ 2 Elysian Grain.\r\n  ‧ 2 Olives.\r\n  ‧ 2 Ambrosia.\r\n  ‧ 2 Stygian Mudskipper.",
                "Bring the Ingredients for the Grecian Baked Fish to Hades.",
                "Meet Hades in Chez Remy.",
                "Listen to Vanellope tell Hades exactly what she thinks of his cooking.",
                "Never pour water on a grease fire! Use the Royal Shovel to put out the flames safely",
                "Debrief Hades about his experience at Chez Remy's",
                "Dress up as a proper salesperson.\r\n  ‧ Professional clothing.\r\n  ‧ Black clothing.\r\n  ‧ Blue clothing.",
                "Listen to Hades' sales pitch to Flynn.",
                "Talk to Hades about his time as a potion salesman.",
                "Visit Ursula's House to find Hades' wages.",
                "Pick up and read Ursula's note.",
                "Find Hades' wages somewhere in the Bind.\r\n  ‧ Ursula's note said the wages would be in a soggy place safe from Hades' temper...",
                "Make sure you have Hades' wages (the Fire Suppression Potion) and Ursula's Note in your Inventory.",
                "Bring Hades his wages (the Fire Suppression Potion).",
                "Visit Scrooge McDuck's Store.",
                "Talk to Scrooge McDuck about hiring Hades for the day.",
                "Return to Scrooge McDuck's Store.",
                "Listen to how Hades handles his first customer.",
                "Save Scrooge McDuck's Store! Extinguish the fire",
                "Listen to Scrooge McDuck react to Hades' treatment of his shop.",
                "Leave Scrooge McDuck's Store and return to the Storybook Vale.",
                "Talk to Hades about his day of management experiments."
            ],
            "rewards": [
                "880 Friendship"
            ],
            "dlc": false,
            "friendship": 4
        },
        {
            "name": "Your Own Personal Hades",
            "id": "hades.friendship.4",
            "objectives": [
                "Meet Daisy and Hades in Hades' House.",
                "Talk to Daisy with Hades in Hades' House.",
                "Gather the materials for Hades merch.\r\n  ‧ 5 Common Club Rushes.\r\n  ‧ 5 Blue Flowers.\r\n  ‧ 5 Magma.",
                "Make sure you have the materials for the Hades Merch in your Inventory.\r\n  ‧ 5 Common Club Rushes\r\n  ‧ 5 Blue Flowers\r\n  ‧ 5 Magma",
                "Bring the materials for Hades' merch to Daisy.",
                "Dress up with the Hades Merch.",
                "See how Hades likes his merch.",
                "Hang out with Hades and take pictures of yourself and Hades in various locations of Mythopia.\r\n  ‧ The Elysian Fields.\r\n  ‧ The Fiery Plains.\r\n  ‧ The Statues' Shadow.",
                "Head back to your House to check your mail.",
                "Read your letter from Daisy.",
                "Gather materials to build the Hades Kiosk.\r\n  ‧ Star Sapphire.\r\n  ‧ 25 Petrified Wood.\r\n  ‧ 5 Marble.\r\n  ‧ 1 Crimson Eternal Poppies.\r\n  ‧ 1 Magma.",
                "Craft the Hades Kiosk.",
                "See how Hades is preparing for his endorsement presentation.",
                "Gather the Ingredients needed for Hades' Spanakopita and Olympian Tapenade.\r\n  ‧ 1 Onion.\r\n  ‧ 1 Olives.\r\n  ‧ 1 Flyleaf Feta.\r\n  ‧ 1 Elysian Grain.\r\n  ‧ 1 Spinach.\r\n  ‧ 1 Garlic.\r\n  ‧ 1 Honeydew Melon.\r\n  ‧ 1 Salt Crystal.",
                "Make sure you have the Hades Kiosk in your Inventory.",
                "Check in with Daisy the manager about the endorsement deal.",
                "Place the objects needed for Hades' presentation near Scrooge McDuck's Store in the Vale.\r\n  ‧ Hades Kiosk\r\n  ‧ (Optional) Hades Cooking Station.",
                "Gather with the Villagers for Hades' speech.",
                "Return to the speech area near Scrooge McDuck's Store.",
                "Listen to Hades' endorsement speech.",
                "Cook up some Greek meals for Hades while he gives his endorsement speech.\r\n  ‧ Spanakopita.\r\n  ‧ Olympian Tapenade.",
                "(Optional) Talk to Scrooge McDuck.",
                "See how Hades liked his time as a celebrity."
            ],
            "rewards": [
                "2200 Friendship",
                "Hades Kiosk",
                "Hades Merch Tee"
            ],
            "dlc": false,
            "friendship": 7
        },
        {
            "name": "Fine, I'll Do It Myself",
            "id": "hades.friendship.5",
            "objectives": [
                "Talk to Tiana.",
                "Talk to Hades about Tiana's request.",
                "Grow the Underworld Gemstones into signposts for Tiana's Palace.\r\n  ‧ Plant the 4 Underworld Gemstones in Mythopia.\r\n  ‧ Water the 4 Underworld Gemstones and wait 5 minutes to harvest the signposts.",
                "Decorate Mythopia with the 4 Hades Signposts.",
                "Talk to Hades about entertainment for his party.",
                "Tag along with Hades as he auditions musicians for his party.\r\n  ‧ Eric's Flute Audition.\r\n  ‧ Mirabel's Vocal Audition.",
                "Talk to Hades about the auditions.",
                "Gather resources to make a Corinthian Marble DJ Table.\r\n  ‧ 15 Marble.\r\n  ‧ 20 Magma.\r\n  ‧ 10 Lightning.",
                "Craft a Corinthian Marble DJ Table.",
                "Make sure you have the Corinthian Marble DJ Table in your Inventory.",
                "Bring the Corinthian Marble DJ Table to Hades.",
                "Make sure you have enough resources for Hades' Party Invitations:\r\n  ‧ 4 Blue Bird Snippet from the Bind.\r\n  ‧ 4 Opal.\r\n  ‧ 3 Yellow Tale Cone Flowers.\r\n  ‧ Craft 4 Hades' Party Invitations.",
                "Meet Hades at the gates to Mount Olympus.",
                "Give Hades' Party Invitations to Hades.",
                "Dress up in Artemis-core.\r\n  ‧ Green Clothing.\r\n  ‧ Yellow Clothing.\r\n  ‧ Sporty Clothing.",
                "Enter the palace atop Mount Olympus by following the sign with Hades' face and venture to Hades' throne room for the party.",
                "Reach the party atop Mount Olympus.\r\n  ‧ Hades set up a portal at the entrance to the palace to speed people along.",
                "Talk to Hades.",
                "Listen to various Villagers express their feelings about Hades' DJ set atop Mount Olympus.\r\n  ‧ Scrooge McDuck.\r\n  ‧ Flynn.\r\n  ‧ Mother Gothel.",
                "The party is not over!\r\n  ‧ Return to the top of Mount Olympus.",
                "See how Hades felt about his performance."
            ],
            "rewards": [
                "3080 Friendship",
                "Armor of the Styx",
                "Corinthian Marble DJ Table"
            ],
            "dlc": false,
            "friendship": 10
        }
    ]
}