{
    "icon": "star",
    "name": "maleficent.story",
    "quests": [
        {
            "name": "The Mistress of All Evil",
            "id": "maleficent.story.1",
            "objectives": [
                "Explore the Beanstalk Marshes around Maleficent's castle.",
                "Explore Everafter and complete the three Fairy Tale Trials to reach Maleficent's castle.\r\n  ‧ The Wolf of the Wilds.\r\n  ‧ Teapot Falls.\r\n  ‧ Knights of the Round Table.",
                "Enter Maleficent's Catle.",
                "Talk to Maleficent inside her castle.",
                "Find Maleficent's missing Spinning Wheel and Throne in her castle, then place them back in the main room.",
                "Place all of Maleficent's furniture back where it belongs.\r\n  ‧ Maleficent's Throne.\r\n  ‧ Maleficent's Candelabra.\r\n  ‧ Maleficent's Fire.\r\n  ‧ Maleficent's Spinning Wheel.",
                "Pass through the portal to Maleficent's throne room.",
                "Catch 1 Maleficent's Pets.",
                "Catch 3 Maleficent's Pets.",
                "Talk to Maleficent."
            ],
            "rewards": [],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "The Unwritten Realms: Maleficent's Gift",
            "id": "maleficent.story.2",
            "objectives": [
                "Explore the waiting room of the Unwritten Realms.",
                "Talk to Maleficent.",
                "Talk to the Magic Quill in the waiting room of the Unwritten Realms.",
                "You've been issued a number and told to wait for service.\r\n  ‧ Wait five billion years for your number to be called.\r\n  ‧ Or talk to Maleficent and find another solution.",
                "Search for all of the 3 pieces of Maleficent's Ticket in the waiting room.",
                "Change the numbers on the \"Now Serving...\" board to match Maleficent's ticket.",
                "Now serving: #9375!\r\n  ‧ Bring Maleficent's Ticket to the Magic Quill.\r\n  ‧ Make sure you have Maleficent's Ticket in your Inventory.",
                "Talk to the Magic Quill on the Review Floor.",
                "Hit the wheel near the Quill with your Royal Net.",
                "Venture through the portal into the Processing Room to find Maleficent's First Anchor Moment.",
                "Solve the puzzles to find Maleficent's First Anchor Moment.",
                "Make sure you have Maleficent's First Anchor Moment in your Inventory.",
                "Bring Maleficent's First Anchor Moment back to her in the waiting room."
            ],
            "spoilers": [
                {
                    "title": "Puzzle solution",
                    "objective": "Row 1: Skull, Griffion, Skull.\r\nRow 2: Griffion, Skull, Griffion.\r\nRow 3: Skull, Griffion, Griffion."
                }
            ],
            "rewards": [],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "The Unwritten Realms: The Spinning Wheel",
            "id": "maleficent.story.3",
            "objectives": [
                "Venture to the second review floor and speak to the Magic Quill there.",
                "Talk to the Magic Quill on the second floor and convince him that you're a supervisor.\r\n  ‧ (Search around for the answers you need!)",
                "Pick up the Conveyor Belt Wheel on the second floor of the Unwritten Realms.",
                "Figure out how to unblock the conveyor by spinning the wheels with your Royal Net.",
                "Venture inside Processing Room B to find Maleficent's Second Anchor Moment.",
                "Solve the puzzles to find Maleficent's Second Anchor Moment in Processing Room B.",
                "Make sure you have Maleficent's Second Anchor Moment in your Inventory.",
                "Bring Maleficent her Second Anchor Moment."
            ],
            "rewards": [],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "The Unwritten Realms: Maleficent's Demise",
            "id": "maleficent.story.4",
            "objectives": [
                "Hit the wheel with your Royal Net to summon the final portal.",
                "Uh-oh. That didn't work...\r\n  ‧ Talk to the Magic Quill near the void on the second floor.",
                "Find a way to retrieve the portal to Maleficent's Third Anchor Moment.",
                "Venture into the processing room to find Maleficent's Third Anchor Moment.",
                "Solve the puzzles to find Maleficent's Third Anchor Moment within the processing room.",
                "One of the Quills has a message for you.\r\n  ‧ Talk to the Quill blocking the path on the second floor.",
                "Make sure you have Maleficent's Third Anchor Moment in your Inventory.",
                "Return to Maleficent and decide what to do next.",
                "Talk to the Lorekeeper.",
                "Welcome Maleficent to the Vale.",
                "Talk to Maleficent.",
                ""
            ],
            "rewards": [
                "Unlock Maleficent"
            ],
            "dlc": false,
            "friendship": 0
        }
    ]
}