{
    "name": "merida.story",
    "quests": [
        {
            "name": "Welcome to the Storybook Vale",
            "id": "merida.story.1",
            "objectives": [
                "Open your mailbox and claim the content of the message titled \"The Storybook Vale awaits...\" to embark on a new adventure.",
                "You need to find a place called the Stardust Port to continue your adventure to the Vale.\r\n  ‧ Complete \"The Port of Many Worlds\" quest.",
                "Use the gate inside the Dream Castle to access the Stardust Port.",
                "Embark on the Hummingbird Airship in the Stardust Port to go to the Storybook Vale.",
                "You've arrived in the Storybook Vale!\r\n  ‧ Explore this strange new world.",
                "That strange magical ink seems to have trapped that Villager!\r\n  ‧ Free Merida and talk to her.",
                "Follow Merida.\r\n  ‧ Talk to Merida.",
                "Talk to... The Lorekeeper?",
                "Find the Royal Net's secret location by investigating The Library of Lore.\r\n  ‧ (Optional) Ask Merida for a hint.",
                "You uncovered the hiding place!\r\n  ‧ Pick up the Royal Net.",
                "Use the Royal Net to catch the Snippets in the main hall of The Library of Lore.\r\n  ‧ Equip the Royal Net and approach the 4 Snippets.",
                "Talk to Merida.",
                "You found the Royal Net! You can now put it to good use:\r\n  ‧ Open the 2 gates to each wing using the right Royal Net swing on the golden wheels.",
                "Catch all 6 Snippets in the Library's wings.",
                "Return to Merida.",
                "(Rearrange stories in the Lorekeeper's pages by talking to her and selecting \"Reorder Stories\" from the dialogue menu!)\r\n  ‧ Rearrange the \"Once Upon a Time in Storybook Vale...\" story in the Lorekeeper's pages.",
                "Talk to The Lorekeeper.",
                "Return to Merida."
            ],
            "rewards": [
                "Unlock Royal Net"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "A New Chapter",
            "id": "merida.story.2",
            "objectives": [
                "Meet Merida near the Well outside the Library of Lore.",
                "Talk to Merida.",
                "Unlock access to the Bind by removing the Wall of Ink blocking the way.\r\n  ‧ Story Magic can be gathered by completing Duties and Achievements.",
                "Explore the Bind with Merida.",
                "The Bind needs some love and care. Restore it to its former glory:\r\n  ‧ Remove 15 Inkies from the Bind.\r\n  ‧ Catch 15 Snippets in the Bind.",
                "The Bind is looking better already!\r\n  ‧ Find Merida and tell her about your progress.",
                "It seems the news of your journey reached Dreamlight Valley and attracted some Villagers:\r\n  ‧ Check in on Goofy\r\n  ‧ Speak to Scrooge McDuck about his store in the Bind.",
                "Goofy and Scrooge McDuck need your help getting to know the Bind.\r\n  ‧ Catch 3 Fish and Seafood around the Bind.\r\n  ‧ Mine 10 gems and minerals from the Bind's mining rocks.",
                "The Bind has plenty to offer! Tell the good news to:\r\n  ‧ Goofy.\r\n  ‧ Scrooge McDuck.",
                "Goofy and Scrooge McDuck are almost open for business! Interact with the Scrooge McDuck Sign beside the following to unlock:\r\n  ‧ Goofy's Stall in the Bind.\r\n  ‧ Scrooge McDuck's General Store in the Bind.",
                "Return to Merida to check in on her progress with the fountains.",
                "Follow Merida.",
                "Talk to Merida.",
                "Open the mysterious door beneath the bridge in the Bind.",
                "You uncovered a secret room beneath the bridge in the Bind!\r\n  ‧ Search for clues in the secret room.",
                "Talk to Merida about your discovery.",
                "Find a way to access what is behind the wall in Aurora's Room.",
                "Use your Royal Net on the wheel inside the secret room.",
                "The fountain sprang to life!\r\n  ‧ Check back with Merida.",
                "Place the foundations for Merida's House in the Bind.",
                "Unlock Merida's House by interacting with the Scrooge McDuck Sign beside it.",
                "Welcome Merida to your Village.",
                "Talk to Merida."
            ],
            "rewards": [
                "1000 Friendship",
                "Unlock Merida"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "A Land of Myths and Legends",
            "id": "merida.story.3",
            "objectives": [
                "You've cleared away the ink! The first part of Mythopia is yours to discover.\r\n  ‧ Explore the Elysian Fields.",
                "You've found a mysterious gateway, swirling with magical ink, deep in the Elysian Fields.\r\n  ‧ Ask the Lorekeeper about it.",
                "You should not venture into the Mythic Trial alone.\r\n  ‧ Talk to Merida.",
                "Follow Merida to the Mythic Trial.",
                "Talk to Merida.",
                "Catch the... Will-o'-the-Wisps? ...racing around the Elysian Fields.",
                "Meet Merida near the entrance to the Trail in the Elysian Fields.",
                "This wheel won't budge no matter how hard you swing your Royal Net.\r\n  ‧ Find a way to power it up. Maybe something to do with the torches...?",
                "Use your Royal Net on the wheel to open the Mythic Trial."
            ],
            "rewards": [],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "The Wolf of the Wilds",
            "id": "merida.story.4",
            "objectives": [
                "You've cleared away the ink! The first part of Everafter is yours to discover.\r\n  ‧ Explore the Wild Woods.",
                "You've found a mysterious gateway, swirling with magical ink, deep in the Wild Woods.\r\n  ‧ Ask the Lorekeeper about it.",
                "The Lorekeeper warned you about venturing into the forest alone.\r\n  ‧ Talk to Merida.",
                "Talk to Merida.",
                "Follow Merida to the Fairy Tale Trial in the Wild Woods.",
                "Talk to Merida.",
                "Follow Merida to the Fairy Tale Trial... but keep an eye out for any big bad wolves.",
                "Talk to Merida.",
                "Merida thinks the wheel was torn off by a wolf...\r\n  ‧ Search the area for the Missing Wheel and restore it to its rightful place.",
                "Use your Royal Net on the wheel to open the Fairy Tale Trial."
            ],
            "rewards": [
                "2200 Friendship"
            ],
            "dlc": false,
            "friendship": 0
        }
    ]
}