{
    "icon": "star",
    "name": "merida.friendship",
    "quests": [
        {
            "name": "Clan DunBroch's Rules of the Hunt",
            "id": "merida.friendship.1",
            "objectives": [
                "Follow Merida.",
                "Clan DunBroch's first rule of the hunt: Control the terrain!\r\n  ‧ Use the Shovel Potion in your Inventory.\r\n  ‧ Remove the 6 Mossy Logs from the Bind.",
                "Return to Merida.",
                "Use the Bind Slow Trap Recipe from your Inventory.",
                "Clan DunBroch's second rule of the hunt: Use everything at your disposal to trap your prey! Gather the materials to make a Snippet Trap.\r\n  ‧ 1 Opal\r\n  ‧ 1 Sorcerer Hat Hermit Crab\r\n  ‧ 5 Pine Cone\r\n  ‧ 10 Moss\r\n  ‧ 500 Storybook Magic",
                "Craft a Basic Fall Leaves Slow Trap to slow Snippets around the Bind.",
                "Place the Fall Leaves Slow Trap anywhere in the Bind.",
                "Return to Merida.",
                "Clan DunBroch's third rule of the hunt: Be patient!\r\n  ‧ Catch 10 Snippets slowed by the Slow Trap in the Bind.",
                "Return to Merida.",
                "Clan DunBroch's fourth rule of the hunt: Let nothing go to waste!\r\n  ‧ Rearrange any Tale in the Lorekeeper's pages. You may need to catch some more Snippets first\r\n  ‧ (Talk to the Lorekeeper and select \"Reorder Tales\" from the dialogue submenu.)",
                "Return to Merida.",
                "Clan DunBroch's fifth rule of the hunt: Commemorate a successful hunt!\r\n  ‧ Place the Storybook Frame anywhere in your House.",
                "Return to Merida."
            ],
            "rewards": [
                "440 Friendship",
                "Storybook Frame",
                "Unlock Gray Storybook Frame recipe",
                "Unlock Storybook Frame recipe",
                "Unlock Wooden Storybook Frame recipe"
            ],
            "dlc": false,
            "friendship": 2
        },
        {
            "name": "Archery and Archrivals",
            "id": "merida.friendship.2",
            "objectives": [
                "Talk to Flynn.",
                "Remove the 5 wanted posters near Flynn's House.",
                "Make sure you have 5 Flynn's Wanted Posters in your Inventory.",
                "Bring Flynn's Wanted Posters to Merida.",
                "Gather the following Ingredients:\r\n  ‧ 2 Persimmon.\r\n  ‧ 2 Sour Berries.",
                "Cook the meal for Merida and Flynn:\r\n  ‧ 2 Persimmon Sour Fondue.",
                "Go inside Merida's cottage for the meal.",
                "Uh-oh... Looks like this meal isn't going so well...\r\n  ‧ Watch Merida and Flynn's argument.",
                "Talk to Merida.",
                "Help Merida set up an archery competition against Flynn by:\r\n  ‧ Placing the 5 Archery Contest Signs around the Bind.",
                "Gather the following materials for the Archery Targets:\r\n  ‧ 20 Petrified Wood.\r\n  ‧ 4 Blue Tale Cone Flower.\r\n  ‧ 6 Yellow Tale Cone Flowers.\r\n  ‧ 16 Wheat.",
                "2 Craft the Archery Target.",
                "Make sure you have the 2 Archery Target in your Inventory.",
                "Bring the Archery Target to Merida.",
                "Meet Merida inside the Fairy Tale Trial in the Wild Woods.",
                "Talk to Merida inside the Fairy Tale Trial.",
                "Talk to Flynn in the Fairy Tale Trial to tell him to start shooting.",
                "Take a picture of Flynn next to the target.",
                "Talk to Flynn in the Fairy Tale Trial.",
                "Talk to Merida in the Fairy Tale Trial.",
                "There's no way Merida would miss that shot!\r\n  ‧ Investigate the targets.",
                "Make sure you have Flynn's Magnet in your Inventory.",
                "Show Flynn's Magnet to Flynn in the Fairy Tale Trial.",
                "Talk to Merida in the Fairy Tale Trial.",
                "Retrieve the Merida's Trick Shot Arrow from the target.",
                "Show the Merida's Trick Shot Arrow to Flynn.",
                "Watch Flynn and Merida chat.",
                "Return to Merida."
            ],
            "rewards": [
                "880 Friendship",
                "5 Archery Contest Sign",
                "Unlock Archery Target recipe"
            ],
            "dlc": false,
            "friendship": 4
        },
        {
            "name": "Change Your Fate",
            "id": "merida.friendship.3",
            "objectives": [
                "Enter Merida's cottage.",
                "Search Merida's cottage for clues.",
                "Pick up the Memory that appeared in Merida's cottage.",
                "Talk to Merida.",
                "Find Merida's best friend - a fierce warrior who's good with a bo staff.",
                "Search for the next clue under the wing of \"a giant flying horse.\"",
                "There's something tucked under the flying horse statue's wing...\r\n  ‧ Take a picture of it.",
                "Show the picture to Merida in the Storybook Vale.",
                "Follow Merida to the giant horse statue in Mythopia.",
                "The clue fell beneath the giant horse statue!\r\n  ‧ Investigate the bag that fell near the giant horse statues.",
                "Pick up the Memory near the giant horse statue.",
                "Talk to Merida.",
                "Search for the next clue \"where the Wolf drinks spilled tea.\"",
                "Pick up the clue along the river.",
                "Talk to Merida.",
                "Search for the next clue in the Library of Lore.\r\n  ‧ The last clue said something about \"finding one's place in the world\"...",
                "Investigate the globe in the Library of Lore.",
                "Pick up the clue beside the globe in the Library of Lore.",
                "Find the location from Merida's Memory in the Bind and obtain her family's artifact.",
                "Uh-oh. Instead of a family artifact, you found a note from Hades. Show Merida what you found.",
                "Talk to Hades.",
                "Check inside Hades' House for the Clan DunBroch treasure.",
                "Search Hades' House for the Clan DunBroch Family Treasure.",
                "Give the Clan DunBroch Family Treasure to Merida."
            ],
            "rewards": [
                "2200 Friendship",
                "Clan DunBroch Family Treasure"
            ],
            "dlc": false,
            "friendship": 7
        },
        {
            "name": "A Very Scottish Celebration",
            "id": "merida.friendship.4",
            "objectives": [
                "Talk to Scrooge about supplies for Merida's Scottish banquet.",
                "Decorate the Vale in Merida's clan colors.\r\n  ‧ Place 10 Clan DunBroch Banner in the Storybook Vale.\r\n  ‧ (Optional) Place 10 Clan McDuck Banner.",
                "The Vale is decorated for the Scots' party. Time to set up the banquet.\r\n  ‧ Bring the Scots' Banquet Supplies to Merida.\r\n  ‧ Make sure the Scots' Banquet Supplies are in your Inventory.",
                "Tiana said she would send the Salt-Baked Sea Wolf Recipe to you in the mail.\r\n  ‧ Check your mailbox for mail from Tiana.",
                "Read the Salt-Baked Sea Wolf Recipe in your Inventory.",
                "Gather Ingredients to cook the Salt-Baked Sea Wolf for Merida:\r\n  ‧ 3 Sea Wolf.\r\n  ‧ 3 Salt Crystal.",
                "Cook 3 Salt-Baked Sea Wolf for the banquet.",
                "Make sure the 3 Salt-Baked Sea Wolf meals are in your Inventory.",
                "Bring the Salt-Baked Sea Wolf to Merida.",
                "Place the Scots' Banquet Setup somewhere in the Storybook Vale.",
                "Enjoy the Scots' Banquet.",
                "The Scots' Banquet was a success!\r\n  ‧ Talk to Merida.\r\n  ‧ (Optional) Talk to Scrooge McDuck.",
                "Talk to the Lorekeeper.",
                "The Lorekeeper wants to give Merida a gift. Gather the supplies to craft it:\r\n  ‧ 20 Petrified Wood.\r\n  ‧ 10 Pine Cone.\r\n  ‧ 8 Topaz.",
                "Craft the Merida's Fate Tapestry.",
                "Make sure the Merida's Fate Tapestry is in your Inventory.",
                "Gift Merida the Merida's Fate Tapestry on behalf of the Lorekeeper.",
                "Listen to Merida and the Lorekeeper.",
                "Talk to Merida."
            ],
            "rewards": [
                "3080 Friendship",
                "Tartan Celebration Outfit",
                "10 Clan DunBroch Banner",
                "10 Clan McDuck Banner"
            ],
            "dlc": false,
            "friendship": 10
        }
    ]
}