{
    "icon": "star",
    "name": "olaf.story",
    "quests": [
        {
            "name": "The Great Blizzard",
            "id": "olaf.story.1",
            "objectives": [
                "There's a magical blizzard in the Frosted Heights!",
                "Consult with Merlin",
                "Search around for clues to the source of the blizzard in Frosted Heights.",
                "Interact with the wall of the cliff.",
                "Enter the secret chamber in the wall of the cliff in Frosted Heights.",
                "Talk to Olaf in the secret chamber.",
                "Search the blizzard for Scary Squirrels",
                "Chase down the Scary Squirrels to get Olaf's buttons and nose back.",
                "Return to the secret chamber and bring Olaf his Nose and Buttons",
                "Talk to Elsa",
                "Investigate the Pillar in Frosted Heights.",
                "Use your Watering Can on the sparkling water particles near the Pillar.",
                "Talk to Elsa about what you saw.",
                "Return to Olaf in the secret chamber.",
                "Use your Watering Can on the sparkling water particles in the secret chamber.",
                "Use your Watering Can on the sparkling water particles closer to the portal in the secret chamber.",
                "Talk to Olaf",
                "Find a book about portals in the secret chamber",
                "Talk to Olaf",
                "Gather the following items:\r\n  ‧ 10 Glass\r\n  ‧ 5 Purified Night Shard\r\n  ‧ 3 Shattered Prism",
                "Craft the Dreamlight Prism at a Crafting Station",
                "Place the Dreamlight Prism on the pedestal in the secret chamber.",
                "Figure out which gems are missing in the secret chamber and replace them.",
                "Whisper one of your deepest fears to the flickering portal in the secret chamber.",
                "The Orb seems to be broken. But at least you found Olaf's arms...",
                "Give Olaf his arms back.",
                "Place the Orb in the Pillar in the Frosted Heights.",
                "Talk to Olaf in the secret chamber"
            ],
            "rewards": [
                "1000 Friendship",
                "Scary Squirrel"
            ],
            "spoilers": [
                {
                    "title": "Secret chamber gem solution",
                    "objective": "To solve the puzzle with the prism on the pedestal, replace the gems that are missing to open the portal. Already displayed are garnet, aquamarine, and topaz. The following gems are missing: Citrine, Amethyst, Emerald"
                },
                {
                    "title": "Gem arrangement",
                    "objective": "Left side: Garnet, Citrine, Topaz.\r\nRight side: Amethyst, Aquamarine, Emerald."
                }
            ]
        },
        {
            "name": "Forgotten Relics: The Blanket",
            "id": "olaf.story.relics.1",
            "objectives": [
                "Talk to Olaf.",
                "Ask Elsa about the Forgotten Blanket."
            ],
            "rewards": [],
            "friendship": 0
        }
    ]
}