{
    "icon": "star",
    "name": "peterpan.friendship",
    "quests": [
        {
            "name": "Shadow Tag",
            "id": "peterpan.friendship.1",
            "objectives": [
                "Talk to Minnie Mouse.",
                "Check Minnie Mouse's House for Peter Pan's shadow.",
                "Search Minnie Mouse's House for Peter Pan's shadow.\r\n  ‧ (Remember: To see shadows, look for the light!)",
                "Talk to Peter Pan inside Minnie Mouse's House.",
                "Gather the following Ingredients:\r\n  ‧ 15 Glass.\r\n  ‧ 6 Iron Ingot.\r\n  ‧ 2 Diamond.",
                "Craft 4 Shadow Spotlight at a Crafting Station.",
                "Talk to Sally.",
                "Meet Peter Pan inside Belle and the Beast's Castle.",
                "(Optional) Listen to the Beast and Peter Pan.",
                "Give Peter the Shadow Thread.",
                "Give Peter the Shadow Thread.",
                "Place the Shadow Spotlights in Belle and the Beast's Castle.\r\n  ‧ First Shadow Spotlight.\r\n  ‧ Second Shadow Spotlight.\r\n  ‧ Third Shadow Spotlight.\r\n  ‧ Fourth Shadow Spotlight.",
                "Wait for the Shadow Spotlights to power on and freeze Peter's shadow.",
                "Listen as Kristoff sews on Peter's shadow.",
                "Talk to Peter Pan"
            ],
            "rewards": [
                "440 Friendship"
            ],
            "dlc": false,
            "friendship": 2
        },
        {
            "name": "A Real Hideout",
            "id": "peterpan.friendship.2",
            "objectives": [
                "Cook for Peter Pan.",
                "Bring to Peter Pan.",
                "Ask the following Villagers for tips about cooking food for kids:\r\n  ‧ Sulley.\r\n  ‧ Remy.",
                "Cook kid-friendly food for Peter Pan:",
                "Peanut Butter Sandwich.",
                "French Fries.",
                "Bring the food to Peter Pan.",
                "Give the food to to Peter Pan.",
                "Help clean Peter Pan's House by clearing 6 Trash Piles.",
                "Pick up the Old Swing in Peter Pan's House.\r\n  ‧ Make sure you have the Old Swing in your Inventory.\r\n  ‧ Bring the Old Swing you found to Peter Pan in his House.",
                "Pick up the Memory in Peter Pan's House.",
                "Talk to Peter Pan about the Memory inside his House.",
                "Find Peter Pan's treasures hidden around the Valley. (Access the Collection menu to look at the Memory.)\r\n  ‧ Telescope\r\n  ‧ Hooked Lamp.\r\n  ‧ Bag of Treasures.",
                "Head back to Peter Pan's House to return his treasures.",
                "Place Peter's treasures back in their proper place in his House.\r\n  ‧ Telescope\r\n  ‧ Hooked Lamp.\r\n  ‧ Bag of Treasures.",
                "Talk to Peter Pan."
            ],
            "rewards": [
                "880 Friendship",
                "Peanut Butter Sandwich Recipe",
                "French Fries Recipe"
            ],
            "dlc": false,
            "friendship": 4
        },
        {
            "name": "The New Lost Boys",
            "id": "peterpan.friendship.3",
            "objectives": [
                "Cook the following desserts for Peter Pan's surprise:\r\n  ‧ 3 Whimsical Pie.\r\n  ‧ 3 Apple Pie.\r\n  ‧ 3 Meringue Pie.",
                "Make sure you have the desserts you baked for Peter Pan in your Inventory.\r\n  ‧ 3 Whimsical Pie.\r\n  ‧ 3 Apple Pie.\r\n  ‧ 3 Meringue Pie.",
                "Bring the deserts you baked to Peter Pan.",
                "Check on The Fairy Godmother inside her House.",
                "Catch up with Peter Pan inside Donald Duck's House.",
                "Donald Duck doesn't seem happy with Peter Pan. Listen in.",
                "Talk to Peter Pan about his dessert attack on Donald Duck.",
                "Clean the places hit by Peter Pan's pie-rate attacks with your Watering Can:\r\n  ‧ 6 Donald Duck's House.",
                "Clean the places hit by Peter Pan's pie-rate attacks with your Watering Can:\r\n  ‧ 6 The Dreamlight Library.",
                "Clean the places hit by Peter Pan's pie-rate attacks with your Watering Can:\r\n  ‧ 6 Scar's Lair.",
                "Attempt a heart-to-heart with Peter Pan about his antics.",
                "Gather Ingredients for your Lost Boys Audition Signs:\r\n  ‧ 50 Softwood.\r\n  ‧ 25 Dry Wood.\r\n  ‧ 10 Green Passion Lily.\r\n  ‧ 10 Red Passion Lily.",
                "Craft the 5 Lost Boys Audition Signs.",
                "Decorate the Valley with the 5 Lost Boys Audition Signs.",
                "Meet Peter Pan in his House to begin the Lost Boys auditions.",
                "Talk to Peter Pan to see if he has candidates to be Lost Boys."
            ],
            "rewards": [
                "2200 Friendship",
                "Whimsical Pie Recipe",
                "Apple Pie Recipe",
                "Meringue Pie Recipe"
            ],
            "dlc": false,
            "friendship": 7
        },
        {
            "name": "The Valley Pirates",
            "id": "peterpan.friendship.4",
            "objectives": [
                "Purchase a Black and Red Top Hat from Scrooge McDuck's General Store.",
                "Put on your Black and Red Top Hat..\r\n  ‧ (Optional: Dress up in a custom Lost Boys costume! Use Bold, Quirky, and Traditional clothing to complete your look.)",
                "Talk to Peter Pan.",
                "Find Eric the Meek hiding somewhere in the Frosted Heights.\r\n  ‧ (Hint: Olaf suggested you check a certain cave...)",
                "Clear the path to Eric the Meek's hiding spot.",
                "Question Prince Eric about the Valley Pirates hideout.",
                "Gather a bribe for the First Mate:\r\n  ‧ 5 Minerals.\r\n  ‧ 10 Gold Nuggets.",
                "Visit the Dreamscape to find the fierce and ferocious First Mate.",
                "Gather the bribe for the First Matehiding in the Dreamscape.\r\n  ‧ 5 Minerals.\r\n  ‧ 10 Gold Nuggets.",
                "Bring the bribe to the First Mate hiding in the Dreamscape.",
                "Approach the Valley Pirates hideout: Skull Rock.",
                "Get past Skull Rock's pirate guard.",
                "Locate the Valley Pirates' Treasure Chest inside Skull Rock.\r\n  ‧ Be careful not to be spotted!",
                "Talk to Peter Pan inside Skull Rock.",
                "Challenge The Forgotten and the Captain of the Valley Pirates for the treasure.",
                "Unlock the Valley Pirates' Treasure Chest.\r\n  ‧ (Open the treasure inside from your inventory!)",
                "Place the Valley Pirates' Treasure Chest in the Valley to celebrate with your fellow Lost Boys.",
                "Take a victory selfie with the Lost Boys and The Forgotten.",
                "Talk to Peter Pan."
            ],
            "rewards": [
                "3080  Friendship",
                "Never Land Adventure Outfit",
                "Valley Pirates' Treasure Chest"
            ],
            "dlc": false,
            "friendship": 10
        }
    ]
}