{
    "name": "rapunzel.story",
    "quests": [
        {
            "name": "The Ancient Door",
            "id": "rapunzel.story.1",
            "objectives": [
                "Use your Hourglass to remove the Gray Floating Rocks behind the Grasslands' waterfall.",
                "Pick up the shining object that fell from the Floating Rocks.",
                "Talk to Rapunzel.",
                "Gather the remaining Sun Core Pieces.\r\n  ‧ Break Gray Floating Rocks around the Isle until you find Sun Core Pieces. (3)",
                "Rebuild the Sun Core at a Crafting Station.",
                "Unlock the Ancient Door behind the waterfall in the Grasslands with the Sun Core.",
                "Pass beyond the Ancient Door with Rapunzel.",
                "Talk to Rapunzel."
            ],
            "rewards": [],
            "friendship": 0
        },
        {
            "name": "The Sundial",
            "id": "rapunzel.story.2",
            "objectives": [
                "Investigate the second Sun Core near the Sundial.",
                "Catch the Floating Sun Core on the Sundial Island.",
                "Make sure you have the Floating Sun Core in your Inventory. (1)",
                "This Sun Core looks just like the last one... Where does it fit here?",
                "Talk to Rapunzel.",
                "Search the Isle for 10 Floating Sundial Gears.",
                "Make sure you have all the Sundial Gears in your Inventory.",
                "Show all the Sundial Gears to Rapunzel.",
                "Rumbling and grinding noises? Investigate the Sundial.",
                "Reach the Statue of Time with Rapunzel.",
                "The Jewel of Time is missing... Investigate the area.",
                "Investigate the diary page near the Statue of Time.",
                "Return to Rapunzel."
            ],
            "rewards": [],
            "friendship": 0
        },
        {
            "name": "The Tower",
            "id": "rapunzel.story.3",
            "objectives": [
                "Follow Rapunzel towards the tower.",
                "Unlock the Grove in the Wild Tangle.\r\n  ‧ Search for Mist with your Hourglass, or access the Dreamlight menu and investigate your new Mist Duties",
                "Meet Rapunzel at her tower.",
                "Dig up 3 Vine Seeds on the Plains near the Oasis.",
                "Return to Rapunzel's Tower.",
                "Return to Rapunzel's Tower..\r\n  ‧ Remove 3 Swirling Sands around Rapunzel's Tower.\r\n  ‧ Talk to Rapunzel.",
                "Put all three Vine Seeds in the soil at the base of Rapunzel's Tower.",
                "Interact with the tower to grow the vines with Hourglass magic.",
                "Enter Rapunzel's Tower using the vine.",
                "Swirling Sands inside?! Talk to Rapunzel.",
                "Clear away the Swirling Sands to reach Gothel's Chest in the Tower.",
                "Open Gothel's Chest in the tower along Rapunzel.",
                "Confront the Sands with Rapunzel.",
                "Talk to Rapunzel in her tower.",
                "You helped Rapunzel banish the Sands from the tower.\r\n  ‧ Collect 1 Jewel of Time.",
                "Investigate the chest in the corner of Rapunzel's Tower.",
                "Return the paints to Rapunzel."
            ],
            "rewards": [
                "Unlock Rapunzel"
            ],
            "friendship": 0
        },
        {
            "name": "All the Right Notes",
            "id": "rapunzel.story.4",
            "objectives": [
                "Talk to Rapunzel.",
                "Find Mother Gothel's Recipe in Rapunzel's Tower.",
                "Pick up Mother Gothel's Recipe from Rapunzel's Tower.",
                "Investigate Mother Gothel's Recipe in your Inventory.",
                "Return to Rapunzel.",
                "Dig up 2 Mother Gothel's Purple Seeds in the Promenade.",
                "Tend to Mother Gothel's Herbs:\r\n  ‧ Plant, water, and harvest 2 Mother Gothel's Herbs after 20 minutes.",
                "Find all the Ingredients for the soup and tea.\r\n  ‧ 2 Majestea.\r\n  ‧ 1 Paprika.\r\n  ‧ 1 Yam.\r\n  ‧ 1 Turnip.",
                "-1 Agave.",
                "Cook Mother Gothel's recipes:\r\n  ‧ Mother Gothel's Soup.\r\n  ‧ Mother Gothel's Tea.",
                "Make sure you have the soup and tea in your Inventory:\r\n  ‧ Mother Gothel's Soup.\r\n  ‧ Mother Gothel's Tea.",
                "Bring the soup and tea to Rapunzel.",
                "Let Rapunzel rest and warm up for five minutes.",
                "Return to Rapunzel."
            ],
            "rewards": [
                "1000 Friendship"
            ],
            "dlc": 1,
            "friendship": 0
        }
    ]
}