{
    "icon": "star",
    "name": "snowwhite.story",
    "quests": [
        {
            "name": "A Wishful Invitation",
            "id": "snowwhite.story.1",
            "objectives": [
                "Your mailbox is suddenly overloaded with spam!\r\n  ‧ Open your mailbox and claim the message FREE VACATION TO WISHBLOSSOM RANCH!!! when you're ready to begin your next adventure.",
                "A free vacation? Seems too good to be true, but you do deserve some rest. The letter mentioned a place named the Stardust Port.\r\n  ‧ Complete \"The Port of Many Worlds\" quest.",
                "A free vacation seems too good to be true...\r\n  ‧ Use the gate in the Dream Castle to access the Stardust Port.",
                "All aboard! Take the Train in the Stardust Port to Wishblossom Ranch.",
                "Wishblossom Ranch is a mess! But since you're already here...\r\n  ‧ Make sure your Wishblossom Ranch Voucher is ready in your Inventory.",
                "Find someone to redeem your Wishblossom Ranch Voucher.",
                "Search the area for something to help you get past the swarm of bees.\r\n  ‧ Maybe there's something in that cave nearby...",
                "Investigate the strange flower inside the cave up the path outside Wishblossom Ranch.",
                "A horse?! It really seems to like you.\r\n  ‧ Approach it and ride it.",
                "Explore the surrounding by the Wishblossom Ranch's entrance and take the Wishblossom Horse for a ride:\r\n  ‧ Hold to gallop.\r\n  ‧ Approach obstacles while galloping to jump over them.",
                "Return to Snow White.",
                "Use the Wishblossom Horse's Push ability to move the flower cart closer to the bees.\r\n  ‧ (Move behind the flower cart and push against it from behind on your horse.)",
                "Talk to Snow White.",
                "Search around the 'Wishing Well near Snow White for clues about the Ranch's ruin.",
                "Talk to Snow White about the Memory you found.",
                "Search around the Ranch's Ruins near Snow White for clues about what happened.",
                "Return to Snow White.",
                "Search around the Ranch's ruined Stable near Snow White for clues about the Ranch's ruin.",
                "Make sure the Strange Feather is in your Inventory.",
                "Return to Snow White to discuss what you found.",
                "Use the sign beside the Stable to upgrade it and open a new stall.",
                "Talk to Snow White."
            ],
            "rewards": [
                "Wishblossom Horse"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "Tales of a Broken Heart",
            "id": "snowwhite.story.2",
            "objectives": [
                "Follow Snow White to the Wishblossom Heart's entrance.",
                "Talk to Snow White.",
                "The crystals seem to react to the presence of your Wishblossom Horse.\r\n  ‧ To remove strange red crystals, approach them while riding the Wishblossom Horse.",
                "The way is clear! Enter the Heart of the Wishblossom Mountains.",
                "Explore deeper inside the Wishblossom Heart.",
                "The Giant Wishblossom is weak. Use your horse to remove strange red crystals:\r\n  ‧ At the end of its leftmost root, atop the rock spire.\r\n  ‧ At the end of its rightmost root, inside the cave.\r\n  ‧ At the end of the rearmost root, atop the overlooking ledge.",
                "The Giant Wishblossom seems ready to bloom. Take a closer look.",
                "Talk to Tinker Bell.",
                "Harvest 10 Dead Wishblossoms by galloping through them on your horse.",
                "Return to Tinker Bell in the Heart.",
                "Follow Tinker Bell in the Heart.",
                "Talk to Tinker Bell.",
                "Return to Wishblossom Ranch.",
                "Talk to Snow White.",
                "Brush your horse.\r\n  ‧ (Stand close to it. Caring for your horse each day will help level it up!)",
                "Some Villagers have arrived at the Wishblossom Ranch!\r\n  ‧ Talk to Scrooge McDuck about Snow White's housing situation.",
                "Place Snow White's House near the Ranch.",
                "Use the Scrooge McDuck Sign near Snow White's House to build it.",
                "Welcome Snow White to the Wishblossom Mountains.",
                "Talk to Snow White."
            ],
            "rewards": [
                "Unlock Snow White",
                "Snow White's Cottage"
            ],
            "dlc": false,
            "friendship": 0
        }
    ]
}