{
    "name": "stitch.friendship",
    "quests": [
        {
            "name": "Goodness Level Check",
            "id": "stitch.friendship.1",
            "objectives": [
                "You found a sign with a strange drawing of Donald on it.",
                "Show the Vandalized Sign to Donald.",
                "Talk to Stitch",
                "Gather the following materials to repair the signs:\r\n  ‧ 15 Hardwood\r\n  ‧ 15 Softwood\r\n  ‧ 3 Vandalized Sign near the entrances to the Peaceful Meadow",
                "Give some of the materials to Stitch\r\n  ‧ 5 Hardwood\r\n  ‧ 5 Softwood\r\n  ‧ 1 Vandalized Sign",
                "Craft two Donald Sign at a Crafting Station",
                "Show the repaired signs to Stitch",
                "Place 3  Donald Sign (and Stitch's Donald Sign) in the Peaceful Meadow",
                "Talk to Stitch",
                "Listen to Stitch apologize to Donald",
                "Talk to Stitch"
            ],
            "rewards": [],
            "friendship": 2
        },
        {
            "name": "Very Sleepy Stitch",
            "id": "stitch.friendship.2",
            "objectives": [
                "Who made a mess near WALL-E's Garden?",
                "Bring the Coffee Cup you found to WALL-E",
                "Make sure you have the Coffee Cup in your Inventory.",
                "Talk to Stitch",
                "Bring the Dried-Out Coffee Sapling to WALL-E",
                "Gather the materials to plant the Coffee Tree:\r\n  ‧ 25 Pebbles\r\n  ‧ 25 Clay\r\n  ‧ 1 Sack",
                "Talk to WALL-E",
                "Craft the Coffee Sapling at a Crafting Station",
                "Plant the Coffee Sapling in the Glade of Trust and tend to it",
                "Pick some Coffee Bean",
                "Return to Stitch",
                "Talk to Remy about what to do with the 3 Coffee Bean",
                "Brew some Coffee for Stitch at a Cooking Station.",
                "Bring Stitch his Coffee"
            ],
            "rewards": [
                "Unlock Coffee Bean"
            ],
            "friendship": 4
        },
        {
            "name": "Stitch's Hobby",
            "id": "stitch.friendship.3",
            "objectives": [
                "Gather the materials to repair the Broken Television\r\n  ‧ 9 Tinkering Parts\r\n  ‧ 3 Gold Ingot\r\n  ‧ 3 Glass",
                "Repair the Broken Television at a Crafting Station",
                "Meet Stitch in his House",
                "Bring Stitch his television",
                "Give Stitch his television",
                "Dress up for an adventure! Style yourself using:\r\n  ‧ A sporty top\r\n  ‧ Sporty pants\r\n  ‧ Sporty shoes",
                "Tell Stitch you're ready to bring him on an adventure.",
                "Meet Stitch inside the Mystical Cave on Dazzle Beach.",
                "Talk to Stitch",
                "Follow Stitch to the bottom of the Mystical Cave.",
                "Meet Stitch inside Ursula's House.",
                "Ursula seems annoyed by your intrusion. Talk to her.",
                "Get out of here before Stitch ends up as part of Ursula's garden!",
                "Talk to Stitch",
                "Listen to Ariel and Stitch",
                "Talk to Stitch"
            ],
            "rewards": [],
            "friendship": 7
        },
        {
            "name": "Making Music",
            "id": "stitch.friendship.4",
            "objectives": [
                "Find Villagers who play the perfect instruments to accompany Stitch.",
                "Ask Scrooge McDuck for some musical equipment.",
                "Gather the materials for the Photo Backdrop\r\n  ‧ 20 Hardwood\r\n  ‧ 10 Glass\r\n  ‧ 10 Fabric\r\n  ‧ 9 Tinkering Parts",
                "Craft the Photo Backdrop",
                "Make sure the Photo Backdrop is in your Inventory",
                "Bring the Photo Backdrop to Scrooge McDuck",
                "Talk to Stitch",
                "Bring Stitch to the Dream Castle",
                "Go to the third floor of the Castle where Scrooge McDuck has set up the Photo Backdrop",
                "Take 3 pictures of Stitch against the Photo Backdrop",
                "Your photos look great! Now for that sound equipment",
                "Talk to Scrooge McDuck",
                "Wait until tomorrow to talk to Stitch",
                "Talk to Stitch",
                "Talk to Scrooge McDuck",
                "Place the Sound Equipment on Dazzle Beach",
                "Attend the party with the Sound Equipment",
                "Talk to Stitch"
            ],
            "rewards": [
                "Stitch's Little Red Ship"
            ],
            "friendship": 10
        }
    ]
}