{
    "icon": "star",
    "name": "tinkerbell.friendship",
    "quests": [
        {
            "name": "Home Is Where the Heart Is",
            "id": "tinkerbell.friendship.1",
            "objectives": [
                "Talk to Snow White.",
                "Talk to Merlin.",
                "Gather the materials needed to craft the Pixie Furniture Set:\r\n  ‧ 10 Reclaimed Barn Wood.\r\n  ‧ 3 Pincushion Peach.\r\n  ‧ 5 Giant Acorns.\r\n  ‧ 5 Copter Seeds.",
                "Craft the Pixie Furniture Set:\r\n  ‧ 2 Floral Fairy Bench.\r\n  ‧ 1 Floral Fairy Table.",
                "Place the Pixie Furniture Set near Snow White's House:\r\n  ‧ 2 Floral Fairy Bench.\r\n  ‧ 1 Floral Fairy Table.",
                "Wait for Merlin and meet up with him near Snow White's House.",
                "Talk to Merlin.",
                "Make sure you have the Tiny Pixie Furniture Set in your Inventory.",
                "Bring the Tiny Pixie Furniture Set to Snow White.",
                "Talk to Tinker Bell about party preparation progress.",
                "Tigger never brought the games for the party...\r\n  ‧ Talk to him.",
                "Locate and dig out the party games in Pixie Flats and Sundae Shores:\r\n  ‧ Bowling Set.\r\n  ‧ Board Game.",
                "You found the games. The party for Snow White can start!\r\n  ‧ Enter the Wishblossom Heart to start the festivities.",
                "Bring the Bowling Set and Board Game to Tinker Bell in the Heart.",
                "take a picture of Tinker Bell in the Heart.",
                "Talk to Tinker Bell.",
                "Decor Pixie Acres with:\r\n  ‧ Tinker Bell's House\r\n  ‧ (Optional) Cute and Rustic furniture to make a space for Tinker Bell's House",
                "Welcome Tinker Bell to the Valley!",
                "Talk to Tinker Bell."
            ],
            "rewards": [
                "Unlock Tinker Bell",
                "Tinker Bell's House"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "Uneasy Neighbors",
            "id": "tinkerbell.friendship.2",
            "objectives": [
                "Follow Tinker Bell to the terrarium in Pixie Acres.",
                "Talk to Tigger.",
                "Gather resources to repair the Pixie Village Terrarium Blueprint:\r\n  ‧ 20 Pixie Dust.\r\n  ‧ 15 Grassy Ore.\r\n  ‧ 10 Copter Seeds.\r\n  ‧ 10 Balloon Fish.\r\n  ‧ 5 Honeycomb Stone.",
                "Use the Scrooge McDuck Sign near the Pixie Village Terrarium and complete all the Blueprint steps:\r\n  ‧ Complete the first Blueprint step.",
                "Talk to Tinker Bell.",
                "Follow Tinker Bell to the \"waterfall\" in Pixie Acres.",
                "Talk to Tinker Bell near the Honey Waterfall in Pixie Acres.",
                "Fish some Honey Coral from the waterfall.",
                "Give Tinker Bell the Honey Coral.",
                "Talk to Tigger.",
                "Cook three different meals using Coral Honey.",
                "(Optional) Talk to Remy for recipe ideas.",
                "Make sure the 3 Coral Honey-based meals are in your Inventory.",
                "Bring the Coral Honey-based meals to Tigger.",
                "Listed to Tigger's apology to Tinker Bell.",
                "Talk to Tinker Bell."
            ],
            "rewards": [
                "Pixie Acres Terrarium",
                "Fairy Boot Cake Recipe",
                "Honey Pancakes Recipe",
                "Honey Glazed Carrots Recipe"
            ],
            "dlc": false,
            "friendship": 4
        },
        {
            "name": "Tink's Trinkets",
            "id": "tinkerbell.friendship.3",
            "objectives": [
                "Check your mailbox for a message from Tigger.\r\n  ‧ (Make sure you collect all items in the message!)",
                "Make sure the Trinket Box is in your Inventory.",
                "Bring the Trinket Box to Tinker Bell.",
                "Gather the materials needed to repair the trinkets:\r\n  ‧ 2 Jasper.\r\n  ‧ 5 Rusty Hinge.\r\n  ‧ 5 Red Currants.\r\n  ‧ 5 Antique Clothes Iron.\r\n  ‧ 4 Fairy Kamut.\r\n  ‧ 4 Fairy Sprinkles.\r\n  ‧ 2 Pyrite.",
                "Repair Tink's trinkets at a Crafting Station:\r\n  ‧ Star Command Laser Toy.\r\n  ‧ Carrot Peeler.\r\n  ‧ Golden Fabric Scissors.",
                "Make sure you have Star Command Laser Toy in your Inventory.",
                "Find the rightful owner of the Star Command Laser Toy.",
                "Make sure you have Carrot Peeler in your Inventory.",
                "Find the rightful owner of the Carrot Peeler.",
                "Make sure you have Golden Fabric Scissors in your Inventory.",
                "Find the rightful owner of the Golden Fabric Scissors.",
                "Talk to Tinker Bell"
            ],
            "rewards": [],
            "dlc": false,
            "friendship": 7
        },
        {
            "name": "Time to Fly",
            "id": "tinkerbell.friendship.4",
            "objectives": [
                "Talk to Peter Pan.",
                "Meet Tinker Bell and Peter Pan in the Wishblossom Heart.",
                "Peter Pan and Tinker Bell are reunited!\r\n  ‧ Talk to Peter Pan.",
                "Something fishy is going on...Spy on Peter Pan and Tinker Bell.",
                "Catch enough fish to learn how to fly? (10K)",
                "Peter and Tink are being suspicious...\r\n  ‧ Talk to Tinker Bell.",
                "Revisit areas in the Wishblossom Mountains to collect Happy Thoughts crystals:\r\n  ‧ The place where you first met your Wishblossom Horse.\r\n  ‧ The beach where you had some fun with BallOOns.\r\n  ‧ The place where you confronted Cruella with skunks.",
                "Make sure the Dreamy Happy Thought is in your Inventory",
                "Make sure the Ambitious Happy Thought is in your Inventory",
                "Make sure the Hopeful Happy Thought is in your Inventory.",
                "Bring the Happy Thoughts to Tinker Bell.",
                "Equip the pixie accessories on your Wishblossom Horse.\r\n  ‧ Pixie Dust Horse Wings Saddle\r\n  ‧ Pixie Magic Gallop Effect.",
                "Your Wishblossom Horse has wings! Time to try them out.\r\n  ‧ Gallop with the Pixie Dust Horse Wings Saddle equipped",
                "Talk to Tinker Bell."
            ],
            "rewards": [
                "Pixie Engineer Outfit",
                "Pixie Dust Horse Wings",
                "Pixie Magic"
            ],
            "dlc": false,
            "friendship": 10
        }
    ]
}