{
    "icon": "star",
    "name": "tinkerbell.story",
    "quests": [
        {
            "name": "Crystal Cavern: Wishing Alps",
            "id": "tinkerbell.story.1",
            "objectives": [
                "You found the Wishing Alps' Crystal Key!\r\n  ‧ Bring it to Tinker Bell in the Wishblossom Heart only where you're ready to delver deeper in the Caverns.",
                "Follow Tinker Bell to the first Crystal Cavern.",
                "Enter the first Crystal Cavern in the Wishblossom Heart.",
                "You made it to the first Crystal Cavern! This door is blocking your way.\r\n  ‧ Use the weight of your horse and large objects to activate the pressure plates on the ground.",
                "It worked! The door is open and the way is clear.\r\n  ‧ Explore deeper inside the Crystal Cavern.",
                "An elevator? Where could it lead?\r\n  ‧ Use the lever on the elevator to activate it.",
                "Continue exploring the Crystal Cavern.",
                "You found the Wishblossom of Hope.\r\n  ‧ ... Talk to it?",
                "The Wishblossom of Hope is weak. Recover its strength by removing crystals on its roots, located:\r\n  ‧ In the blue area by its right root.\r\n  ‧ In the green area behind it.\r\n  ‧ In the pink area to its left.",
                "The Decay crystals have been removed and Pixie Dust is flowing again to the Wishblossom of Hope!\r\n  ‧ Talk to it.",
                "You found Maximus!\r\n  ‧ Approach him and go for a ride.",
                "Maximus can cross large gaps with his Leap ability.",
                "While riding Maximus, hold shift and gallop towards a chasm to jump over it!\r\n  ‧ Reach the crystal archway behind the Wishblossom of Hope by jumping over the water with Maximus.",
                "Exit the Crystal Cavern and return to the Wishblossom Heart."
            ],
            "rewards": [
                "Unlock Maximus"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "Crystal Caverns: Glamour Gulch",
            "id": "tinkerbell.story.2",
            "objectives": [
                "You found Glamour Gulch's Crystal Key.\r\n  ‧ Bring it to Tinker Bell in the Wishblossom Heart only when you're ready to delve deeper in the caves.",
                "Talk to Tinker Bell.",
                "Go inside the Crystal Cavern for Glamour Gulch.",
                "Progress further into the second Crystal Cavern.\r\n  ‧ A proud horse might help jump any large gaps...",
                "Mount Maximus - you've got some tracking to do!\r\n  ‧ Interact with the lever base to pick up the scent trail of the missing lever handle.",
                "Follow the scent trail to find the handle for the lever in the second Crystal Cavern.",
                "Pick up the handle for the lever in the second Crystal Cavern.",
                "Put the handle back on the socket.",
                "You can now use the lowered elevator as a platform for Maximus to jump on!\r\n  ‧ Progress further in the second Crystal Cavern.",
                "Remove the Decay crystals affecting the Wishblossom:\r\n  ‧ In the blue area, on top of the mezzanine near the entrance.\r\n  ‧ In the green flooded area to its right.\r\n  ‧ In the pink area, behind the cluttered elevator to its left.",
                "The Decay crystals are dealt with!\r\n  ‧ Talk to the Wishblossom of Ambition.",
                "Approach Khan and mount it.",
                "A sturdy wooden barricade behind the Giant Wishblossom is blocking the way out of the Crystal Cavern!\r\n  ‧ Interact with the barrier while mounted on Khan to have him use his powerful hooves to break free.",
                "There's a shortcut back to the Wishblossom Heart by using Khan to break the barricades!\r\n  ‧ Return to the Wishblossom Heart."
            ],
            "rewards": [
                "Unlock Khan"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "Crystal Cavern: Pixie Acres",
            "id": "tinkerbell.story.3",
            "objectives": [
                "You found the Crystal Key in Pixie Acres!\r\n  ‧ Bring the Crystal Key to Tinker Bell in the Wishblossom Heart when you're ready to delve deeper.",
                "Talk to Tinker Bell.",
                "Enter the third Crystal Cavern in the Wishblossom Heart.",
                "Break the barricade with Khan.",
                "The door is blocking your way. Find a way to open it.",
                "The way is clear! Explore deeper inside the Crystal Cavern.",
                "Talk to the Wishblossom in the third Crystal Cavern.",
                "Remove the Decay crystals to allow the Wishblossom to bloom.\r\n  ‧ Use Khan in the green area to break the barricade and take the elevator.\r\n  ‧ Use Maximus in the blue area to find the elevator's lever.\r\n  ‧ Use your Wishblossom Horse in the pink area to push the block onto the pressure plate.",
                "Talk to the Wishblossom in the third Crystal Cavern.",
                "Ready to fly out of here?\r\n  ‧ Ride Pegasus and gallop towards the wind tunnel behind the Giant Wishblossom.",
                "Talk to Snow White.",
                "Break the Decay crystals around the Wishblossom Mountains:\r\n  ‧ 18 In the Wishing Alps.\r\n  ‧ 18 In Glamour Gulch.\r\n  ‧ 18 In Pixie Acres.",
                "The Decay won't be stopped. Talk to Tinker Bell in the Wishblossom Heart."
            ],
            "rewards": [
                "Unlock Pegasus"
            ],
            "dlc": false,
            "friendship": 0
        },
        {
            "name": "The Decay",
            "id": "tinkerbell.story.4",
            "objectives": [
                "Talk to Tinker Bell.",
                "Reach Friendship Level 5 with Pegasus to be able to fly to the heart of the maelstrom.\r\n  ‧ Gain XP with your horses by riding them, jumping obstacles, and doing activities. Pet, brush, and feed them each day for big XP boosts!",
                "Talk to Snow White.",
                "Talk to Cruella.",
                "Talk to Tigger.",
                "Put on the Hope Necklace, Ambition Bracelet, and Dream Earrings.\r\n  ‧ Hope Necklace.\r\n  ‧ Ambition Bracelet.\r\n  ‧ Dream Earrings.",
                "Talk to the Giant Wishblossom in the Heart.",
                "Enter the maelstrom in the Wishblossom Heart through the wind tunnel with Pegasus.",
                "Break all 3 Decay crystals at the entrance to the Island.",
                "Use the activated wind tunnel to visit the first Crystal Island.",
                "Talk to Hope Wishblossom.",
                "Break all 5 Decay crystals on the first Crystal Island.",
                "Use the activated wind tunnel to visit the second Crystal Island.",
                "Talk to Ambition Wishblossom.",
                "Break all 5 Decay crystals on the second Crystal Island.",
                "Use the activated wind tunnel to visit the third Crystal Island.",
                "Talk to Dream Wishblossom.",
                "Break all 5 Decay crystals on the third Crystal Island.",
                "Reach the last wind tunnel."
            ],
            "rewards": [
                "Fairy Dust",
                "Bracelet of Ambition",
                "Earrings of Dreams",
                "Necklace of Hope"
            ],
            "dlc": false,
            "friendship": 0
        }
    ]
}